esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>INT_CLR</name>
          <description>eFuse interrupt clear register.</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>READ_DONE_INT_CLR</name>
              <description>The clear signal for read_done interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PGM_DONE_INT_CLR</name>
              <description>The clear signal for pgm_done interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CONF</name>
          <description>Controls the eFuse programming voltage.</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0x1fe17</resetValue>
          <fields>
            <field>
              <name>DAC_CLK_DIV</name>
              <description>Controls the division factor of the rising clock of the programming voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_PAD_SEL</name>
              <description>Don't care.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_NUM</name>
              <description>Controls the rising period of the programming voltage.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OE_CLR</name>
              <description>Reduces the power supply of the programming voltage.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_TIM_CONF</name>
          <description>Configures read timing parameters.</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0x16010201</resetValue>
          <fields>
            <field>
              <name>THR_A</name>
              <description>Configures the read hold time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRD</name>
              <description>Configures the read time.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUR_A</name>
              <description>Configures the read setup time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_INIT_NUM</name>
              <description>Configures the waiting time of reading eFuse memory.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF1</name>
          <description>Configurarion register 1 of eFuse programming timing parameters.</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0x1300001</resetValue>
          <fields>
            <field>
              <name>TSUP_A</name>
              <description>Configures the programming setup time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_ON_NUM</name>
              <description>Configures the power up time for VDDQ.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THP_A</name>
              <description>Configures the programming hold time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF2</name>
          <description>Configurarion register 2 of eFuse programming timing parameters.</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0xc80190</resetValue>
          <fields>
            <field>
              <name>PWR_OFF_NUM</name>
              <description>Configures the power outage time for VDDQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPGM</name>
              <description>Configures the active programming time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF0_RS_BYPASS</name>
          <description>Configurarion register0 of eFuse programming time parameters and rs bypass operation.</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
              <name>BYPASS_RS_CORRECTION</name>
              <description>Set this bit to bypass reed solomon correction step.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_RS_BLK_NUM</name>
              <description>Configures block number of programming twice operation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Set this bit to update multi-bit register signals.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPGM_INACTIVE</name>
              <description>Configures the inactive programming time.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_WR_DIS</name>
          <description>eFuse apb2otp block0 data register1.</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_WR_DIS</name>
              <description>Otp block0 write disable data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W1</name>
          <description>eFuse apb2otp block0 data register2.</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W1</name>
              <description>Otp block0 backup1 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W2</name>
          <description>eFuse apb2otp block0 data register3.</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W2</name>
              <description>Otp block0 backup1 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W3</name>
          <description>eFuse apb2otp block0 data register4.</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W3</name>
              <description>Otp block0 backup1 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W4</name>
          <description>eFuse apb2otp block0 data register5.</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W4</name>
              <description>Otp block0 backup1 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W5</name>
          <description>eFuse apb2otp block0 data register6.</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W5</name>
              <description>Otp block0 backup1 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W1</name>
          <description>eFuse apb2otp block0 data register7.</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W1</name>
              <description>Otp block0 backup2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W2</name>
          <description>eFuse apb2otp block0 data register8.</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W2</name>
              <description>Otp block0 backup2 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W3</name>
          <description>eFuse apb2otp block0 data register9.</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W3</name>
              <description>Otp block0 backup2 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W4</name>
          <description>eFuse apb2otp block0 data register10.</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W4</name>
              <description>Otp block0 backup2 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W5</name>
          <description>eFuse apb2otp block0 data register11.</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W5</name>
              <description>Otp block0 backup2 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W1</name>
          <description>eFuse apb2otp block0 data register12.</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W1</name>
              <description>Otp block0 backup3 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W2</name>
          <description>eFuse apb2otp block0 data register13.</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W2</name>
              <description>Otp block0 backup3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W3</name>
          <description>eFuse apb2otp block0 data register14.</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W3</name>
              <description>Otp block0 backup3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W4</name>
          <description>eFuse apb2otp block0 data register15.</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W4</name>
              <description>Otp block0 backup3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W5</name>
          <description>eFuse apb2otp block0 data register16.</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W5</name>
              <description>Otp block0 backup3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W1</name>
          <description>eFuse apb2otp block0 data register17.</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W1</name>
              <description>Otp block0 backup4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W2</name>
          <description>eFuse apb2otp block0 data register18.</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W2</name>
              <description>Otp block0 backup4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W3</name>
          <description>eFuse apb2otp block0 data register19.</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W3</name>
              <description>Otp block0 backup4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W4</name>
          <description>eFuse apb2otp block0 data register20.</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W4</name>
              <description>Otp block0 backup4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W5</name>
          <description>eFuse apb2otp block0 data register21.</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W5</name>
              <description>Otp block0 backup4 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W1</name>
          <description>eFuse apb2otp block1 data register1.</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W1</name>
              <description>Otp block1  word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W2</name>
          <description>eFuse apb2otp block1 data register2.</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W2</name>
              <description>Otp block1  word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W3</name>
          <description>eFuse apb2otp block1 data register3.</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W3</name>
              <description>Otp block1  word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W4</name>
          <description>eFuse apb2otp block1 data register4.</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W4</name>
              <description>Otp block1  word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W5</name>
          <description>eFuse apb2otp block1 data register5.</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W5</name>
              <description>Otp block1  word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W6</name>
          <description>eFuse apb2otp block1 data register6.</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W6</name>
              <description>Otp block1  word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W7</name>
          <description>eFuse apb2otp block1 data register7.</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W7</name>
              <description>Otp block1  word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W8</name>
          <description>eFuse apb2otp block1 data register8.</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W8</name>
              <description>Otp block1  word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W9</name>
          <description>eFuse apb2otp block1 data register9.</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W9</name>
              <description>Otp block1  word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
