esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>APB2OTP_BLK10_W3</name>
          <description>eFuse apb2otp block10 data register3.</description>
          <addressOffset>0x6e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W3</name>
              <description>Otp block10 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W4</name>
          <description>eFuse apb2otp block10 data register4.</description>
          <addressOffset>0x6e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W4</name>
              <description>Otp block10 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W5</name>
          <description>eFuse apb2otp block10 data register5.</description>
          <addressOffset>0x6e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W5</name>
              <description>Otp block10 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W6</name>
          <description>eFuse apb2otp block10 data register6.</description>
          <addressOffset>0x6ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W6</name>
              <description>Otp block10 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W7</name>
          <description>eFuse apb2otp block10 data register7.</description>
          <addressOffset>0x6f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W7</name>
              <description>Otp block10 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W8</name>
          <description>eFuse apb2otp block10 data register8.</description>
          <addressOffset>0x6f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W8</name>
              <description>Otp block10 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W9</name>
          <description>eFuse apb2otp block10 data register9.</description>
          <addressOffset>0x6f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W9</name>
              <description>Otp block10 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W10</name>
          <description>eFuse apb2otp block10 data register10.</description>
          <addressOffset>0x6fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W10</name>
              <description>Otp block10 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W11</name>
          <description>eFuse apb2otp block10 data register11.</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W11</name>
              <description>Otp block10 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_EN</name>
          <description>eFuse apb2otp enable configuration register.</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_APB2OTP_EN</name>
              <description>Apb2otp mode enable signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>General Purpose Input/Output</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x60091000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2cc</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>STRAP</name>
          <description>Strapping pin register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STRAPPING</name>
              <description>Represents the values of GPIO strapping pins. 

