esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
    - bit0: invalid
    - bit1: MTMS
    - bit2: MTDI
    - bit3: GPIO27
    - bit4: GPIO28
    - bit5: GPIO7
    - bit6 ~ bit15: invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>GPIO output register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of GPIO0 ~ 31 output in simple GPIO output mode.\\
0: Low level\\
1: High level\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TS</name>
          <description>GPIO output set register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TS</name>
              <description>Configures whether or not to set the output register GPIO_OUT_REG of GPIO0 ~ GPIO31.\\
0: Not set\\
1: The corresponding bit in GPIO_OUT_REG will be set to 1\\
Recommended operation: use this register to set GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TC</name>
          <description>GPIO output clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TC</name>
              <description>Configures whether or not to clear the output register GPIO_OUT_REG of GPIO0 ~ GPIO31 output.\\
0: Not clear\\
1: The corresponding bit in GPIO_OUT_REG will be cleared.\\
Recommended operation: use this register to clear GPIO_OUT_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1</name>
          <description>GPIO output register for GPIO32-32</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output value of GPIO32 ~ 32 output in simple GPIO output mode.\\
0: Low level\\
1: High level\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_W1TS</name>
          <description>GPIO output set register for GPIO32-32</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT1_W1TS</name>
              <description>Configures whether or not to set the output register GPIO_OUT1_REG of GPIO32 ~ GPIO32.\\
0: Not set\\
1: The corresponding bit in GPIO_OUT_REG will be set to 1\\
Recommended operation: use this register to set GPIO_OUT1_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1_W1TC</name>
          <description>GPIO output clear register for GPIO32-32</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT1_W1TC</name>
              <description>Configures whether or not to clear the output register GPIO_OUT1_REG of GPIO32 ~ GPIO32 output.\\
0: Not clear\\
1: The corresponding bit in GPIO_OUT_REG will be cleared.\\
Recommended operation: use this register to clear GPIO_OUT1_REG. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>GPIO output enable register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO0 ~ GPIO31.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TS</name>
          <description>GPIO output enable set register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TS</name>
              <description>Configures whether or not to set the output enable register GPIO_ENABLE_REG of GPIO0 ~ GPIO31.\\
0: Not set\\
1: The corresponding bit in GPIO_ENABLE_REG will be set to 1\\
Recommended operation: use this register to set GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TC</name>
          <description>GPIO output enable clear register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TC</name>
              <description>Configures whether or not to clear the output enable register GPIO_ENABLE_REG of GPIO0 ~ GPIO31. \\
0: Not clear\\
1: The corresponding bit in GPIO_ENABLE_REG will be cleared\\
Recommended operation: use this register to clear GPIO_ENABLE_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1</name>
          <description>GPIO output enable register for GPIO32-32</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO32 ~ GPIO32.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1_W1TS</name>
          <description>GPIO output enable set register for GPIO32-32</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE1_W1TS</name>
              <description>Configures whether or not to set the output enable register GPIO_ENABLE_REG of GPIO32 ~ GPIO32.\\
0: Not set\\
1: The corresponding bit in GPIO_ENABLE_REG will be set to 1\\
Recommended operation: use this register to set GPIO_ENABLE1_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE1_W1TC</name>
          <description>GPIO output enable clear register for GPIO32-32</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE1_W1TC</name>
              <description>Configures whether or not to clear the output enable register GPIO_ENABLE_REG of GPIO32 ~ GPIO32. \\
0: Not clear\\
1: The corresponding bit in GPIO_ENABLE_REG will be cleared\\
Recommended operation: use this register to clear GPIO_ENABLE1_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN</name>
          <description>GPIO input register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO0 ~ GPIO31. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN1</name>
          <description>GPIO input register for GPIO32-32</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO32 ~ GPIO32. Each bit represents a pin input value:\\
0: Low level\\
1: High level\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>GPIO interrupt status register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of GPIO0 ~ GPIO31, can be configured by the software. 

