esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
    - Each bit represents the status of its corresponding GPIO:
    
        - 0: Represents the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TS</name>
          <description>GPIO interrupt status set register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TS</name>
              <description>Configures whether or not to set the interrupt status register GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31. 

    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this register to set GPIO_STATUS_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TC</name>
          <description>GPIO interrupt status clear register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register GPIO_STATUS_INTERRUPT of GPIO0 ~ GPIO31. 

    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this register to clear GPIO_STATUS_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1</name>
          <description>GPIO interrupt status register for GPIO32-32</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>The interrupt status of GPIO32 ~ GPIO32, can be configured by the software. 

    - Each bit represents the status of its corresponding GPIO:
    
        - 0: Represents the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 0 by the software.
        - 1: Represents the GPIO generates the interrupt configured by GPIO_PIN0_INT_TYPE, or this bit is configured to 1 by the software.
    </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1_W1TS</name>
          <description>GPIO interrupt status set register for GPIO32-32</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS1_W1TS</name>
              <description>Configures whether or not to set the interrupt status register GPIO_STATUS_INTERRUPT of GPIO32 ~ GPIO32. 

    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be set to 1. \item Recommended operation: use this register to set GPIO_STATUS_INTERRUPT. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS1_W1TC</name>
          <description>GPIO interrupt status clear register for GPIO32-32</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS1_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register GPIO_STATUS_INTERRUPT of GPIO32 ~ GPIO32. 

    - If the value 1 is written to a bit here, the corresponding bit in GPIO_STATUS_INTERRUPT will be cleared. \item Recommended operation: use this register to clear GPIO_STATUS_INTERRUPT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROCPU_INT</name>
          <description>GPIO_PROCPU_INT interrupt status register for GPIO0-31</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROCPU_INT</name>
              <description>Represents the CPU interrupt status of GPIO0 ~ GPIO31. Each bit represents:\\
0: Represents CPU interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the CPU interrupt is enabled.\\
This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROCPU_INT1</name>
          <description>GPIO_PROCPU_INT interrupt status register for GPIO32-32</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROCPU_INT1</name>
              <description>Represents the CPU interrupt status of GPIO32 ~ GPIO32. Each bit represents:\\
0: Represents CPU interrupt is not enabled, or the GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: Represents the GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE after the CPU interrupt is enabled.\\
This interrupt status is corresponding to the bit in GPIO_STATUS_REG when assert (high) enable signal (bit13 of GPIO_PIN0_REG). \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT</name>
          <description>GPIO interrupt source register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT</name>
              <description>Represents the interrupt source signal of GPIO0 ~ GPIO31.\\
Each bit represents:\\
0: The GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: The GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT1</name>
          <description>GPIO interrupt source register for GPIO32-32</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT1</name>
              <description>Represents the interrupt source signal of GPIO32 ~ GPIO32.\\
Each bit represents:\\
0: The GPIO does not generate the interrupt configured by GPIO_PIN0_INT_TYPE.\\
1: The GPIO generates an interrupt configured by GPIO_PIN0_INT_TYPE.\\
The interrupt could be rising edge interrupt, falling edge interrupt, level sensitive interrupt and any edge interrupt.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>29</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN%s</name>
          <description>GPIO$N configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable CPU interrupt or CPU non-maskable interrupt.

    - bit13: Configures whether or not to enable CPU interrupt:\\
    0: Disable\\
    1: Enable\\
    - bit14 ~ bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN29</name>
          <description>GPIO29 configuration register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable CPU interrupt or CPU non-maskable interrupt.

    - bit13: Configures whether or not to enable CPU interrupt:\\
    0: Disable\\
    1: Enable\\
    - bit14 ~ bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN30</name>
          <description>GPIO30 configuration register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable CPU interrupt or CPU non-maskable interrupt.

    - bit13: Configures whether or not to enable CPU interrupt:\\
    0: Disable\\
    1: Enable\\
    - bit14 ~ bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN31</name>
          <description>GPIO31 configuration register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable CPU interrupt or CPU non-maskable interrupt.

    - bit13: Configures whether or not to enable CPU interrupt:\\
    0: Disable\\
    1: Enable\\
    - bit14 ~ bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN32</name>
          <description>GPIO32 configuration register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select pin drive mode. \\
0: Normal output\\
1: Open drain output \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO interrupt type.\\
0: GPIO interrupt disabled\\
1: Rising edge trigger\\
2: Falling edge trigger\\
3: Any edge trigger\\
4: Low level trigger\\
5: High level trigger\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO wake-up function.\\
0: Disable\\
1: Enable\\
This function only wakes up the CPU from Light-sleep. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_ENA</name>
              <description>Configures whether or not to enable CPU interrupt or CPU non-maskable interrupt.

    - bit13: Configures whether or not to enable CPU interrupt:\\
    0: Disable\\
    1: Enable\\
    - bit14 ~ bit17: invalid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
