esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>FUNC0_IN_SEL_CFG</name>
          <description>Configuration register for input signal 0</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC0_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal 0.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC0_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG0_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>9</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>21</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC70_IN_SEL_CFG</name>
          <description>Configuration register for input signal 70</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>FUNC70_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal 70.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC70_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG70_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>19</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 29 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
Or\\
0x40: A constantly high input\\
0x50: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>29</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO%s output</description>
          <addressOffset>0xac4</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO%s.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit %s of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit %s of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC29_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb38</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC29_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC29_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC29_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC29_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC30_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb3c</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC30_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC30_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC30_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC30_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC31_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb40</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC31_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC31_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC31_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC31_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC32_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb44</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC32_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC32_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC32_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC32_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>GPIO clock gate register</description>
          <addressOffset>0xdf8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
