esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0xdfc</addressOffset>
          <size>32</size>
          <resetValue>0x2312140</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_EXT</name>
      <description>GPIO_EXT Peripheral</description>
      <groupName>GPIO_EXT</groupName>
      <baseAddress>0x60091e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO_EXT</name>
        <value>32</value>
      </interrupt>
      <registers>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock Gating Configure Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Clock enable bit of configuration registers for sigma delta modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA_MISC</name>
          <description>MISC Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SIGMADELTA_CLK_EN</name>
              <description>Configures whether or not to enable the clock for sigma delta modulation.\\
0: Not enable\\
1: Enable\\%\label{fielddesc:GPIOSDSPISWAP}- [GPIOSD_SPI_SWAP] Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SIGMADELTA%s</name>
          <description>Duty cycle configuration register for SDM channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0xff00</resetValue>
          <fields>
            <field>
              <name>SD_IN</name>
              <description>Configures the duty cycle of sigma delta modulation output. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_PRESCALE</name>
              <description>Configures the divider value to divide IO MUX operating clock. \\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_COMP_CONFIG_0</name>
          <description>Configuration register for zero-crossing detection</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XPD_COMP_0</name>
              <description>Configures whether to enable the function of analog PAD voltage comparator.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_COMP_0</name>
              <description>Configures the reference voltage for analog PAD voltage comparater.. \\
0: Reference voltage is the internal reference voltage, meanwhile GPIO8 PAD can be used as a regular GPIO\\
1: Reference voltage is the voltage on the GPIO8 PAD\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DREF_COMP_0</name>
              <description>Configures the internal reference voltage for analog PAD voltage coparator. \\
0: Internal reference voltage is 0 * VDDPST1\\
1: Internal reference voltage is 0.1 * VDDPST1\\
…...\\
6: Internal reference voltage is 0.6 * VDDPST1\\
7: Internal reference voltage is 0.7 * VDDPST1\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_COMP_FILTER_0</name>
          <description>Configuration register for interrupt source mask period of zero-crossing detection</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZERO_DET_FILTER_CNT_0</name>
              <description>Configures the period of masking new interrupt source foe analog PAD voltage comparator.\\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GLITCH_FILTER_CH%s</name>
          <description>Glitch Filter Configure Register of Channel%s</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FILTER_CH0_EN</name>
              <description>Configures whether or not to enable channel %s of Glitch Filter.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_CH0_INPUT_IO_NUM</name>
              <description>Configures to select the input GPIO for Glitch Filter. \\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\
29 ~ 63: Reserved\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_CH0_WINDOW_THRES</name>
              <description>Configures the window threshold for Glitch Filter. The window threshold should be less than or equal to GPIOSD_FILTER_CH%s_WINDOW_WIDTH.\\  %see DOC-4768\\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_CH0_WINDOW_WIDTH</name>
              <description>Configures the window width for Glitch Filter. The effective value of window width is 0 ~ 63. \\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ETM_EVENT_CH%s_CFG</name>
          <description>Etm Config register of Channel%s</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_CH0_EVENT_SEL</name>
              <description>Configures to select GPIO for ETM event channel.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
27: Select GPIO27\\
28: Select GPIO28\\ 
29 ~ 63: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_CH0_EVENT_EN</name>
              <description>Configures whether or not to enable ETM event send.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P0_CFG</name>
          <description>GPIO selection register 0 for ETM</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO0_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO0_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO1_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO1_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO2_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO2_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO3_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO3_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO4_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO4_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P1_CFG</name>
          <description>GPIO selection register 1 for ETM</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ETM_TASK_GPIO5_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO5_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO6_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO6_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO7_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO7_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO8_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO8_EN</name>
              <description>Configures whether or not to enable GPIO23 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO9_SEL</name>
              <description>Configures to select an ETM task channel for GPIO24.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\%\label{fielddesc:GPIOSDETMTASKGPIO1EN}- [GPIOSD_ETM_TASK_GPIO1_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO1SEL}- [GPIOSD_ETM_TASK_GPIO1_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO2EN}- [GPIOSD_ETM_TASK_GPIO2_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO2SEL}- [GPIOSD_ETM_TASK_GPIO2_SEL] GPIO choose a etm task channel. %\label{fielddesc:GPIOSDETMTASKGPIO3EN}\item [GPIOSD_ETM_TASK_GPIO3_EN] Enable bit of GPIO response etm task. %\label{fielddesc:GPIOSDETMTASKGPIO3SEL}\item [GPIOSD_ETM_TASK_GPIO3_SEL] GPIO choose a etm task channel.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_GPIO9_EN</name>
              <description>Configures whether or not to enable GPIO29 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
