esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER0_OVF_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_TIMER0_OVF_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_OVF_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_TIMER1_OVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_OVF_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_TIMER2_OVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_OVF_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_TIMER3_OVF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH0_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH0_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH1_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH1_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH2_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH2_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH3_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH3_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH4_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH4_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH5_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_DUTY_CHNG_END_CH5_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH0_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH0_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH1_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH1_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH2_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH2_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH3_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH3_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH4_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH4_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF_CNT_CH5_INT_ENA</name>
              <description>Enable bit: Write 1 to enable LEDC_OVF_CNT_CH5_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER0_OVF_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_TIMER0_OVF_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER1_OVF_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_TIMER1_OVF_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER2_OVF_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_TIMER2_OVF_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMER3_OVF_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_TIMER3_OVF_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH0_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH0_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH1_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH1_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH2_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH2_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH3_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH3_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH4_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH4_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DUTY_CHNG_END_CH5_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_DUTY_CHNG_END_CH5_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH0_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH0_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH1_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH1_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH2_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH2_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH3_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH3_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH4_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH4_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OVF_CNT_CH5_INT_CLR</name>
              <description>Clear bit: Write 1 to clear LEDC_OVF_CNT_CH5_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_GAMMA_CONF</name>
          <description>Ledc ch%s gamma config register.</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_GAMMA_ENTRY_NUM</name>
              <description>Configures the number of duty cycle fading rages for LEDC ch%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_PAUSE</name>
              <description>Configures whether or not to pause duty cycle fading of LEDC ch%s.\\0: Invalid. No effect\\1: Pause</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_GAMMA_RESUME</name>
              <description>Configures whether or nor to resume duty cycle fading of LEDC ch%s.\\0: Invalid. No effect\\1: Resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_TASK_EN0</name>
          <description>Ledc event task enable bit register0.</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVT_DUTY_CHNG_END_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH4 event.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH5 event.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH4 event.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH5 event.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER0_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER0 event.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER1_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER1 event.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER2_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER2 event.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER3_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER3 event.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME0_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER0_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME1_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER1_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME2_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER2_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME3_CMP_EN</name>
              <description>Configures whether or not to enable the LEDC_EVT_TIMER3_CMP event.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH0_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH1_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH2_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH3_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH4_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH5_EN</name>
              <description>Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
