esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_CLKRST</name>
      <description>LP_CLKRST Peripheral</description>
      <groupName>LP_CLKRST</groupName>
      <baseAddress>0x600b0400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LP_CLK_CONF</name>
          <description>Configures the root clk of LP system</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>SLOW_CLK_SEL</name>
              <description>Configures the source of LP_SLOW_CLK.
0: RC_SLOW_CLK
1: XTAL32K_CLK 
2: RC32K_CLK
3:OSC_SLOW_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_CLK_SEL</name>
              <description>configures the source of LP_FAST_CLK.
0: RC_FAST_CLK
1: XTAL_D2_CLK
2: XTAL_CLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_PERI_DIV_NUM</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CLK_PO_EN</name>
          <description>Configures the clk gate to pad</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x7ff</resetValue>
          <fields>
            <field>
              <name>AON_SLOW_OEN</name>
              <description>Configures the clock gate to pad of the LP_DYN_SLOW_CLK.
0: Disable the clk pass clock gate
1: Enable the clk pass clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_FAST_OEN</name>
              <description>Configures the clock gate to pad of the LP_DYN_FAST_CLK. 
0: Disable the clk pass clock gate  
1: Enable the clk pass clock gate</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOSC_OEN</name>
              <description>Configures the clock gate to pad of the OSC_SLOW_CLK.  
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOSC_OEN</name>
              <description>Configures the clock gate to pad of the RC_FAST_CLK. 
0: Disable the clk pass clock gate  
1: Enable the clk pass clock gate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC32K_OEN</name>
              <description>Configures the clock gate to pad of the RC32K_CLK. 
0: Disable the clk pass clock gate  
1: Enable the clk pass clock gate</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL32K_OEN</name>
              <description>Configures the clock gate to pad of the XTAL32K_CLK. 
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_EFUSE_OEN</name>
              <description>Configures the clock gate to pad of the EFUSE_CTRL clock. 
0: Disable the clk pass clock gate  
1: Enable the clk pass clock gate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOW_OEN</name>
              <description>Configures the clock gate to pad of the LP_SLOW_CLK.
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_OEN</name>
              <description>Configures the clock gate to pad of the LP_FAST_CLK. 
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_OEN</name>
              <description>Configures the clock gate to pad of the RNG clk. 
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPBUS_OEN</name>
              <description>Configures the clock gate to pad of the LP bus clk. 
0: Disable the clk pass clock gate 
1: Enable the clk pass clock gate</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CLK_EN</name>
          <description>Configure LP root clk source gate</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FAST_ORI_GATE</name>
              <description>Configures the clock gate to LP_FAST_CLK
0: Invalid. The clock gate controlled by hardware fsm
1: Force the clk pass clock gate</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_RST_EN</name>
          <description>Configures the peri of LP system software reset</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HUK_RESET_EN</name>
              <description>Configures whether or not to reset  HUK
0: Invalid.No effect
1: Reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_EFUSE_CORE_RESET_EN</name>
              <description>Configures whether or not to reset  EFUSE_CTRL always-on part
0: Invalid.No effect
1: Reset</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TIMER_RESET_EN</name>
              <description>Configures whether or not to reset  LP_TIMER
0: Invalid.No effect
1: Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_RESET_EN</name>
              <description>Configures whether or not to reset LP_WDT and super watch dog
0: Invalid.No effect 
1: Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANA_PERI_RESET_EN</name>
              <description>Configures whether or not to reset analog peri, include brownout controller
0: Invalid.No effect
1: Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_CAUSE</name>
          <description>Represents the reset casue</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>RESET_CAUSE</name>
              <description>Represents the reset cause</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE0_RESET_FLAG</name>
              <description>Represents the reset flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE0_RESET_CAUSE_CLR</name>
              <description>0: no operation</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE0_RESET_FLAG_SET</name>
              <description>configure set reset flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE0_RESET_FLAG_CLR</name>
              <description>configure clear reset flag
0: no operation
1: clear flag to 0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_RESET</name>
          <description>Configures CPU reset</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x4600000</resetValue>
          <fields>
            <field>
              <name>HPCORE0_LOCKUP_RESET_EN</name>
              <description>configure the hpcore0 luckup reset enable
0: disable
1:enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_WDT_CPU_RESET_LENGTH</name>
              <description>configures the reset length of LP_WDT reset CPU
Measurement unit: LP_DYN_FAST_CLK</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_WDT_CPU_RESET_EN</name>
              <description>Configures whether or not LP_WDT can reset CPU
0: LP_WDT could not reset CPU when LP_WDT timeout 
1: LP_WDT could reset CPU when LP_WDT timeout</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_STALL_WAIT</name>
              <description>configure the time between CPU stall and reset
Measurement unit: LP_DYN_FAST_CLK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_STALL_EN</name>
              <description>Configures whether or not CPU entry stall state before LP_WDT and software reset CPU
0: CPU will not entry stall state before LP_WDT and software reset CPU 
1: CPU will entry stall state before LP_WDT and software reset CPU</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FOSC_CNTL</name>
          <description>Configures the RC_FAST_CLK frequency</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x2b000000</resetValue>
          <fields>
            <field>
              <name>FOSC_DFREQ</name>
              <description>Configures the RC_FAST_CLK frequency,the clock frequency will increase with this field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32K_CNTL</name>
          <description>Configures the RC32K_CLK frequency</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x2b000000</resetValue>
          <fields>
            <field>
              <name>RC32K_DFREQ</name>
              <description>Configures the RC32K_CLK frequency, the clock frequency will increase with this field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TO_HP</name>
          <description>Configures the clk gate of LP clk to HP system</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0xf0000000</resetValue>
          <fields>
            <field>
              <name>ICG_HP_XTAL32K</name>
              <description>Configures the clk gate of XTAL32K_CLK to HP system
0: The clk could not pass to HP system
1: The clk could pass to HP system</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICG_HP_SOSC</name>
              <description>Configures the clk gate of RC_SLOW_CLK to HP system
0: The clk could not pass to HP system
1: The clk could pass to HP system</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICG_HP_OSC32K</name>
              <description>Configures the clk gate of RC32K_CLK to HP system
0: The clk could not pass to HP system
1: The clk could pass to HP system</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICG_HP_FOSC</name>
              <description>Configures the clk gate of RC_FAST_CLK to HP system
0: The clk could not pass to HP system
1: The clk could pass to HP system</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMEM_FORCE</name>
          <description>Configures the LP_MEM clk gate force parameter</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LPMEM_CLK_FORCE_ON</name>
              <description>Configures whether ot not force open the clock gate of LP MEM
0: Invalid. The clock gate controlled by hardware FSM
1: Force open clock gate of LP MEM</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPERI</name>
          <description>Configures the LP peri clk</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>HUK_CLK_SEL</name>
              <description>Configures the source clk of HUK
0: 0: RC_FAST_CLK  
1: XTAL_D2_CLK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_I2C_CLK_SEL</name>
              <description>Configures the source clk of LP I2C.
0: LP_FAST_CLK 
1: XTAL_D2_CLK</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_UART_CLK_SEL</name>
              <description>Configures the source clk of LP UART.
0: LP_FAST_CLK
1: XTAL_D2_CLK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL32K</name>
          <description>Configures the XTAL32K parameter</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x66c00000</resetValue>
          <fields>
            <field>
              <name>DRES_XTAL32K</name>
              <description>Configures DRES</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DGM_XTAL32K</name>
              <description>Configures DGM</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_XTAL32K</name>
              <description>Configures DBUF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_XTAL32K</name>
              <description>Configures DAC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2305080</resetValue>
          <fields>
            <field>
              <name>CLKRST_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>configure register clk bypass clk gate</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
