esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_GPIO</name>
      <description>Low-power General Purpose Input/Output</description>
      <groupName>LP_GPIO</groupName>
      <baseAddress>0x600b4400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OUT</name>
          <description>LP GPIO output register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_ORIG</name>
              <description>Configures the output of GPIO0 ~ GPIO7.\\
0: Low level\\
1: High level\\
bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TS</name>
          <description>LP GPIO output set register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TS</name>
              <description>Configures whether or not to enable the output register LP_IO_OUT_REG of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_OUT_REG will be set to 1.
    - Recommended operation: use this register to set LP_IO_OUT_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_W1TC</name>
          <description>LP GPIO output clear register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_W1TC</name>
              <description>Configures whether or not to clear the output register LP_IO_OUT_REG of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_OUT_REG will be cleared.
    - Recommended operation: use this register to clear LP_IO_OUT_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>LP GPIO output enable register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Configures whether or not to enable the output of GPIO0 ~ GPIO7.\\
0: Not enable\\
1: Enable\\
bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TS</name>
          <description>LP GPIO output enable set register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TS</name>
              <description>Configures whether or not to set the output enable register LP_IO_ENABLE_REG of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_ENABLE_REG will be set to 1.
    - Recommended operation: use this register to set LP_IO_ENABLE_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE_W1TC</name>
          <description>LP GPIO output enable clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_W1TC</name>
              <description>Configures whether or not to clear the output enable register LP_IO_ENABLE_REG of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_ENABLE_REG will be cleared.
    - Recommended operation: use this register to clear LP_IO_ENABLE_REG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN</name>
          <description>LP GPIO input register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA_NEXT</name>
              <description>Represents the input value of GPIO0 ~ GPIO7.\\
0: Low level input\\
1: High level input\\
bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>LP GPIO interrupt status register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT</name>
              <description>Configures the interrupt status of GPIO0 ~ GPIO7.\\
0: No interrupt\\
1: Interrupt is triggered\\
Bit0 is corresponding to GPIO0, bit1 is corresponding to GPIO1, and etc. This register is used together LP_IO_PIN0_INT_TYPE in register LP_IO_PIN0_REG.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TS</name>
          <description>LP GPIO interrupt status set register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TS</name>
              <description>Configures whether or not to set the interrupt status register LP_IO_STATUS_INT of GPIO0 ~ GPIO7.\\

    - Bit0 is corresponding to GPIO0, bit1 is corresponding to GPIO1, and etc.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_STATUS_INT will be set to 1.
    - Recommended operation: use this register to set LP_IO_STATUS_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_W1TC</name>
          <description>LP GPIO interrupt status clear register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_W1TC</name>
              <description>Configures whether or not to clear the interrupt status register LP_IO_STATUS_INT of GPIO0 ~ GPIO7. \\

    - Bit0 is corresponding to GPIO0, bit1 is corresponding to GPIO1, and etc.
    - If the value 1 is written to a bit here, the corresponding bit in LP_IO_STATUS_INT will be cleared
    - ecommended operation: use this register to clear LP_IO_STATUS_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_NEXT</name>
          <description>LP GPIO interrupt source register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATUS_INTERRUPT_NEXT</name>
              <description>Represents the interrupt source status of GPIO0 ~ GPIO7.\\
bit0 ~ bit7 are corresponding to GPIO0 ~ 7. Each bit represents:\\
0: Interrupt source status is invalid.\\
1: Interrupt source status is valid.\\ 
The interrupt here can be rising-edge triggered, falling-edge triggered, any edge triggered, or level triggered.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN0</name>
          <description>LP GPIO0 configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select the pin dirve mode of GPIO0.\\
0: Normal output\\
1: Open drain output\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>Configures whether or not to clear the edge wake-up status of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the edge wake-up status of corresponding GPIO will be cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO0 interrupt type.\\
    0: GPIO interrupt disabled \\
    1: Rising edge trigger \\
    2: Falling edge trigger \\
    3: Any edge trigger \\
    4: Low level trigger \\
    5: High level trigger \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO0 wake-up function.\\
0: Not enable\\
1: Enable\\
This function is disabled when PD_LP_PERI is powered off.\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN1</name>
          <description>LP GPIO1 configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select the pin dirve mode of GPIO1.\\
0: Normal output\\
1: Open drain output\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>Configures whether or not to clear the edge wake-up status of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the edge wake-up status of corresponding GPIO will be cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO1 interrupt type.\\
    0: GPIO interrupt disabled \\
    1: Rising edge trigger \\
    2: Falling edge trigger \\
    3: Any edge trigger \\
    4: Low level trigger \\
    5: High level trigger \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO1 wake-up function.\\
0: Not enable\\
1: Enable\\
This function is disabled when PD_LP_PERI is powered off.\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN2</name>
          <description>LP GPIO2  configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select the pin dirve mode of GPIO2.\\
0: Normal output\\
1: Open drain output\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>Configures whether or not to clear the edge wake-up status of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the edge wake-up status of corresponding GPIO will be cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO2 interrupt type.\\
    0: GPIO interrupt disabled \\
    1: Rising edge trigger \\
    2: Falling edge trigger \\
    3: Any edge trigger \\
    4: Low level trigger \\
    5: High level trigger \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO2 wake-up function.\\
0: Not enable\\
1: Enable\\
This function is disabled when PD_LP_PERI is powered off.\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN3</name>
          <description>LP GPIO3 configuration register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select the pin dirve mode of GPIO3.\\
0: Normal output\\
1: Open drain output\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>Configures whether or not to clear the edge wake-up status of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the edge wake-up status of corresponding GPIO will be cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO3 interrupt type.\\
    0: GPIO interrupt disabled \\
    1: Rising edge trigger \\
    2: Falling edge trigger \\
    3: Any edge trigger \\
    4: Low level trigger \\
    5: High level trigger \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO3 wake-up function.\\
0: Not enable\\
1: Enable\\
This function is disabled when PD_LP_PERI is powered off.\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN4</name>
          <description>LP GPIO4 configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC2_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the second-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_DRIVER</name>
              <description>Configures to select the pin dirve mode of GPIO4.\\
0: Normal output\\
1: Open drain output\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC1_BYPASS</name>
              <description>Configures whether or not to synchronize GPIO input data on either edge of LP IO MUX operating clock for the first-level synchronization.\\
0: Not synchronize\\
1: Synchronize on falling edge\\
2: Synchronize on rising edge\\
3: Synchronize on rising edge\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_WAKEUP_CLR</name>
              <description>Configures whether or not to clear the edge wake-up status of GPIO0 ~ GPIO7.\\

    - bit0 ~ bit7 are corresponding to GPIO0 ~ GPIO7.
    - If the value 1 is written to a bit here, the edge wake-up status of corresponding GPIO will be cleared.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INT_TYPE</name>
              <description>Configures GPIO4 interrupt type.\\
    0: GPIO interrupt disabled \\
    1: Rising edge trigger \\
    2: Falling edge trigger \\
    3: Any edge trigger \\
    4: Low level trigger \\
    5: High level trigger \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_ENABLE</name>
              <description>Configures whether or not to enable GPIO4 wake-up function.\\
0: Not enable\\
1: Enable\\
This function is disabled when PD_LP_PERI is powered off.\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
