esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TEE</name>
      <description>Low-power Trusted Execution Environment</description>
      <groupName>LP_TEE</groupName>
      <baseAddress>0x600b3400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>M0_MODE_CTRL</name>
          <description>TEE mode control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>M0_MODE</name>
              <description>Configures M0 security level mode.\\ 
0: tee_mode \\ 
1: ree_mode0 \\ 
2: ree_mode1 \\ 
3: ree_mode2  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M0_LOCK</name>
              <description>Set 1 to lock m0 tee configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\ 
0: enable automatic clock gating \\ 
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_ACC_HP</name>
          <description>Force access to hpmem configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FORCE_ACC_HPMEM_EN</name>
              <description>Configures whether to allow LP CPU to force access to HP_MEM regardless of permission management.\\
0: disable force access HP_MEM \\
1: enable force access HP_MEM \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2212160</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_TIMER</name>
      <description>Low-power Timer</description>
      <groupName>LP_TIMER</groupName>
      <baseAddress>0x600b0c00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4c</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_RTC_TIMER</name>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>TAR0_LOW</name>
          <description>RTC timer threshold low bits register0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_TAR_LOW0</name>
              <description>Configures the lower 32 bits of the trigger threshold for the RTC timer compare0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR0_HIGH</name>
          <description>RTC timer enable register0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_TAR_HIGH0</name>
              <description>Configures the higher 16 bits of the trigger threshold for the RTC timer compare0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_TAR_EN0</name>
              <description>Configure this bit to enable the timer compare0 alarm.\\0: Disable \\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR1_LOW</name>
          <description>RTC timer threshold low bits register1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_TAR_LOW1</name>
              <description>Configures the lower 32 bits of the trigger threshold for the RTC timer compare1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR1_HIGH</name>
          <description>RTC timer threshold high bits register0</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_TAR_HIGH1</name>
              <description>Configures the higher 16 bits of the trigger threshold for the RTC timer compare1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_TAR_EN1</name>
              <description>Configure this bit to enable the timer compare1 alarm.\\0: Disable \\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE</name>
          <description>RTC timer update control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_UPDATE</name>
              <description>Triggers timer by software</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MAIN_TIMER_REGDMA_WORK</name>
              <description>Selects the triggering condition for the RTC timer,triggered when regdma working</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_XTAL_OFF</name>
              <description>Selects the triggering condition for the RTC timer,triggered when XTAL\_CLK powers up</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_SYS_STALL</name>
              <description>Selects the triggering condition for the RTC timer,triggered when CPU enters or exits the stall state.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_SYS_RST</name>
              <description>Selects the triggering condition for the RTC timer,triggered when resetting digital core completes</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_BUF0_LOW</name>
          <description>RTC timer buffer0 low bits register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_BUF0_LOW</name>
              <description>RTC timer buffer0 low bits register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_BUF0_HIGH</name>
          <description>RTC timer buffer0 high bits register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_BUF0_HIGH</name>
              <description>RTC timer buffer0 high bits register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_BUF1_LOW</name>
          <description>RTC timer buffer1 low bits register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_BUF1_LOW</name>
              <description>RTC timer buffer1 low bits register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_BUF1_HIGH</name>
          <description>RTC timer buffer1 high bits register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_BUF1_HIGH</name>
              <description>RTC timer buffer1 high bits register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_OVERFLOW</name>
          <description/>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_ALARM_LOAD</name>
              <description/>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>RTC timer interrupt raw register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVERFLOW_RAW</name>
              <description>Triggered when counter register of RTC main timer overflow.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC_WAKEUP_INT_RAW</name>
              <description>Triggered when RTC main timer reach the target value.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>RTC timer interrupt status register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVERFLOW_ST</name>
              <description>Status of RTC main timer overflow interrupt .</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOC_WAKEUP_INT_ST</name>
              <description>Status of RTC main timer interrupt .</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>RTC timer interrupt enable register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVERFLOW_ENA</name>
              <description>Enable the RTC main timer overflow interrupt..\\0 : Disable \\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOC_WAKEUP_INT_ENA</name>
              <description>Enable the RTC main timer interrupt..\\0 : Disable \\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>RTC timer interrupt clear register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVERFLOW_CLR</name>
              <description>Clear the RTC main timer overflow raw interrupt..</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOC_WAKEUP_INT_CLR</name>
              <description>Clear the RTC main timer raw interrupt..</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_RAW</name>
          <description>RTC timer interrupt raw register(For ULP)</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_OVERFLOW_LP_INT_RAW</name>
              <description>Triggered when counter register of RTC main timer overflow</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_LP_INT_RAW</name>
              <description>Triggered when RTC main timer reach the target value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_ST</name>
          <description>RTC timer interrupt status register(For ULP)</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_OVERFLOW_LP_INT_ST</name>
              <description>Status of RTC main timer overflow interrupt .</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAIN_TIMER_LP_INT_ST</name>
              <description>Status of RTC main timer interrupt .</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_ENA</name>
          <description>RTC timer interrupt enable register(For ULP)</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_OVERFLOW_LP_INT_ENA</name>
              <description>Enable the RTC main timer overflow interrupt..\\0 : Disable \\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAIN_TIMER_LP_INT_ENA</name>
              <description>Enable the RTC main timer interrupt..\\0 : Disable \\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_INT_CLR</name>
          <description>RTC timer interrupt clear register(For ULP)</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MAIN_TIMER_OVERFLOW_LP_INT_CLR</name>
              <description>Clear the RTC main timer overflow clear interrupt..</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MAIN_TIMER_LP_INT_CLR</name>
              <description>Clear the RTC main timer clear interrupt..</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2311090</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
