esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>RMT_SCLK_CONF</name>
          <description>RMT_SCLK configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x101000</resetValue>
          <fields>
            <field>
              <name>RMT_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the rmt function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_SEL</name>
              <description>Configures the clock source of RMT.\\
0: XTAL_CLK\\
1 (default): RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_SCLK_EN</name>
              <description>Set 1 to enable rmt function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_PD_CTRL</name>
          <description>RMT power control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>RMT_MEM_FORCE_PU</name>
              <description>Set this bit to force power up RMT memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_MEM_FORCE_PD</name>
              <description>Set this bit to force power down RMT memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_CONF</name>
          <description>LEDC configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LEDC_CLK_EN</name>
              <description>Set 1 to enable ledc apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_RST_EN</name>
              <description>Set 0 to reset ledc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_READY</name>
              <description>Query this field after reset ledc module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_SCLK_CONF</name>
          <description>LEDC_SCLK configuration register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC_SCLK_SEL</name>
              <description>Configures the clock source of LEDC.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_SCLK_EN</name>
              <description>Set 1 to enable ledc function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_PD_CTRL</name>
          <description>LEDC power control register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LEDC_MEM_FORCE_PU</name>
              <description>Set this bit to force power up LEDC memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_MEM_FORCE_PD</name>
              <description>Set this bit to force power down LEDC memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_CONF</name>
          <description>TIMERGROUP0 configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x1d</resetValue>
          <fields>
            <field>
              <name>TG0_CLK_EN</name>
              <description>Set 1 to enable timer_group0 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_RST_EN</name>
              <description>Set 0 to reset timer_group0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_WDT_READY</name>
              <description>Query this field after reset timer_group0 wdt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TG0_TIMER0_READY</name>
              <description>Query this field after reset timer_group0 timer0 module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TG0_TIMER1_READY</name>
              <description>Query this field after reset timer_group0 timer1 module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_TIMER_CLK_CONF</name>
          <description>TIMERGROUP0_TIMER_CLK configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>TG0_TIMER_CLK_SEL</name>
              <description>Configures the clock source of general-purpose timers in Timer Group 0.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_TIMER_CLK_EN</name>
              <description>Set 1 to enable timer_group0 timer clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP0_WDT_CLK_CONF</name>
          <description>TIMERGROUP0_WDT_CLK configuration register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>TG0_WDT_CLK_SEL</name>
              <description>Configures the clock source of WDT in Timer Group 0.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_WDT_CLK_EN</name>
              <description>Set 1 to enable timer_group0 wdt clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_CONF</name>
          <description>TIMERGROUP1 configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x1d</resetValue>
          <fields>
            <field>
              <name>TG1_CLK_EN</name>
              <description>Set 1 to enable timer_group1 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_RST_EN</name>
              <description>Set 0 to reset timer_group1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_READY</name>
              <description>Query this field after reset timer_group1 wdt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TG1_TIMER0_READY</name>
              <description>Query this field after reset timer_group1 timer0 module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TG1_TIMER1_READY</name>
              <description>Query this field after reset timer_group1 timer1 module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_TIMER_CLK_CONF</name>
          <description>TIMERGROUP1_TIMER_CLK configuration register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>TG1_TIMER_CLK_SEL</name>
              <description>Configures the clock source of general-purpose timers in Timer Group 1.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_TIMER_CLK_EN</name>
              <description>Set 1 to enable timer_group1 timer clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP1_WDT_CLK_CONF</name>
          <description>TIMERGROUP1_WDT_CLK configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>TG1_WDT_CLK_SEL</name>
              <description>Configures the clock source of WDT in Timer Group 1.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F80M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_CLK_EN</name>
              <description>Set 1 to enable timer_group0 wdt clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_CONF</name>
          <description>SYSTIMER configuration register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_CLK_EN</name>
              <description>Set 1 to enable systimer apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_RST_EN</name>
              <description>Set 0 to reset systimer module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_READY</name>
              <description>Query this field after reset systimer module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_FUNC_CLK_CONF</name>
          <description>SYSTIMER_FUNC_CLK configuration register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x400000</resetValue>
          <fields>
            <field>
              <name>SYSTIMER_FUNC_CLK_SEL</name>
              <description>Configures the clock source of System Timer.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_FUNC_CLK_EN</name>
              <description>Set 1 to enable systimer function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_CONF</name>
          <description>I2S configuration register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xc</resetValue>
          <fields>
            <field>
              <name>I2S_CLK_EN</name>
              <description>Set 1 to enable i2s apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RST_EN</name>
              <description>Set 0 to reset i2s module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_READY</name>
              <description>Query this field before using i2s rx function, after reset i2s module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2S_TX_READY</name>
              <description>Query this field before using i2s tx function, after reset i2s module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_TX_CLKM_CONF</name>
          <description>I2S_TX_CLKM configuration register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
              <name>I2S_TX_CLKM_DIV_NUM</name>
              <description>Integral I2S TX clock divider value. f_I2S_CLK = f_I2S_CLK_S/(N+b/a). There will be (a-b) * n-div and b * (n+1)-div.  So the average combination will be:  for b &lt;= a/2, z * [x * n-div + (n+1)-div] + y * n-div. For b &gt; a/2, z * [n-div + x * (n+1)-div] + y * (n+1)-div.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_SEL</name>
              <description>Configures the clock source of I2S TX.\\
0 (default): XTAL_CLK\\
1: PLL_F240M_CLK\\
2: PLL_F160M_CLK\\
3: I2S_MCLK_in\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_EN</name>
              <description>Set 1 to enable i2s_tx function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_TX_CLKM_DIV_CONF</name>
          <description>I2S_TX_CLKM_DIV configuration register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>I2S_TX_CLKM_DIV_Z</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_Z is b. For b &gt; a/2, the value of I2S_TX_CLKM_DIV_Z is (a-b).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_Y</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_Y is (a%b) . For b &gt; a/2, the value of I2S_TX_CLKM_DIV_Y is (a%(a-b)).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_X</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_X is (a/b) - 1. For b &gt; a/2, the value of I2S_TX_CLKM_DIV_X is (a/(a-b)) - 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_TX_CLKM_DIV_YN1</name>
              <description>For b &lt;= a/2, the value of I2S_TX_CLKM_DIV_YN1 is 0 . For b &gt; a/2, the value of I2S_TX_CLKM_DIV_YN1 is 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_RX_CLKM_CONF</name>
          <description>I2S_RX_CLKM configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
              <name>I2S_RX_CLKM_DIV_NUM</name>
              <description>Integral I2S clock divider value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_SEL</name>
              <description>Configures the clock source of I2S RX.\\
0 (default): XTAL_CLK\\
1: PLL_F240M_CLK\\
2: PLL_F160M_CLK\\
3: I2S_MCLK_in\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_EN</name>
              <description>Set 1 to enable i2s_rx function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_MCLK_SEL</name>
              <description>Configures to select master clock.\\
0 (default): I2S_TX_CLK\\
1: I2S_RX_CLK\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_RX_CLKM_DIV_CONF</name>
          <description>I2S_RX_CLKM_DIV configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>I2S_RX_CLKM_DIV_Z</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_Z is b. For b &gt; a/2, the value of I2S_RX_CLKM_DIV_Z is (a-b).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_Y</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_Y is (a%b) . For b &gt; a/2, the value of I2S_RX_CLKM_DIV_Y is (a%(a-b)).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_X</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_X is (a/b) - 1. For b &gt; a/2, the value of I2S_RX_CLKM_DIV_X is (a/(a-b)) - 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_RX_CLKM_DIV_YN1</name>
              <description>For b &lt;= a/2, the value of I2S_RX_CLKM_DIV_YN1 is 0 . For b &gt; a/2, the value of I2S_RX_CLKM_DIV_YN1 is 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
