esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>PLL_DIV_CLK_EN</name>
          <description>SPLL DIV clock-gating configuration register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0x1ff</resetValue>
          <fields>
            <field>
              <name>PLL_240M_CLK_EN</name>
              <description>This field is used to open 240 MHz clock (div2 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_160M_CLK_EN</name>
              <description>This field is used to open 160 MHz clock (div3 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_120M_CLK_EN</name>
              <description>This field is used to open 120 MHz clock (div4 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_80M_CLK_EN</name>
              <description>This field is used to open 80 MHz clock (div6  of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_60M_CLK_EN</name>
              <description>This field is used to open 60 MHz clock (div8 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_48M_CLK_EN</name>
              <description>This field is used to open 48 MHz clock (div10 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_40M_CLK_EN</name>
              <description>This field is used to open 40 MHz clock (div12 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_20M_CLK_EN</name>
              <description>This field is used to open 20 MHz clock (div24 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_12M_CLK_EN</name>
              <description>This field is used to open 12 MHz clock (div40 of SPLL) drived from SPLL. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLK_OUT_EN</name>
          <description>CLK_OUT_EN configuration register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0x7ff</resetValue>
          <fields>
            <field>
              <name>CLK20_OEN</name>
              <description>Set 1 to enable 20m clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK22_OEN</name>
              <description>Set 1 to enable 22m clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK44_OEN</name>
              <description>Set 1 to enable 44m clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_BB_OEN</name>
              <description>Set 1 to enable bb clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK80_OEN</name>
              <description>Set 1 to enable 80m clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK160_OEN</name>
              <description>Set 1 to enable 160m clock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_320M_OEN</name>
              <description>Set 1 to enable 320m clock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_ADC_INF_OEN</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DAC_CPU_OEN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK40X_BB_OEN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_OEN</name>
              <description>Set 1 to enable xtal clock</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_32K_CONF</name>
          <description>32KHz clock configuration register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x700</resetValue>
          <fields>
            <field>
              <name>_32K_SEL</name>
              <description>Configures the 32KHz clock for TIMER_GROUP.\\
0 (default): RC32K_CLK\\
1: XTAL32K_CLK\\
2: OSC_SLOW_CLK\\
3: RC_SLOW_CLK\\
4: RC_FAST_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOSC_TICK_NUM</name>
              <description>When PCR_32K_SEL set as 4, This field PCR_FOSC_TICK_NUM is used to set the divider number of fosc.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_POWER_CONF_0</name>
          <description>HP SRAM/ROM configuration register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>ROM_FORCE_PU</name>
              <description>Set this bit to force power up ROM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_FORCE_PD</name>
              <description>Set this bit to force power down ROM.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A gate-clock will be used when accessing the ROM.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_POWER_CONF_1</name>
          <description>HP SRAM/ROM configuration register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>SRAM_FORCE_PU</name>
              <description>Set this bit to force power up SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_FORCE_PD</name>
              <description>Set this bit to force power down SRAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A gate-clock will be used when accessing the SRAM.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CONF</name>
          <description>Clock source configuration register for External Memory Encryption and Decryption</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC_CLK_SEL</name>
              <description>Configures the clock source for the External Memory Encryption and Decryption module.\\
0(default): XTAL_CLK\\
1 RC_FAST_CLK\\
2: PLL_F480M_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RST_EN</name>
              <description>Set 0 to reset sec module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_DAC_INV_PHASE_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_RX_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TX_DAC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PWDET_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CLK_UPDATE</name>
          <description>Configuration register for applying updated high-performance system clock sources</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_CLOCK_UPDATE</name>
              <description>Configures whether or not to update configurations for CPU_CLK division, AHB_CLK division and HP_ROOT_CLK clock source selection.\\
0: Not update configurations\\
1: Update configurations\\
This bit is automatically cleared when configurations have been updated.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_CLK_DIV</name>
          <description>SAR ADC clock divisor configuration register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0x404</resetValue>
          <fields>
            <field>
              <name>SAR2_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDET_SAR_CLK_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0x107</resetValue>
          <fields>
            <field>
              <name>PWDET_SAR_CLK_DIV_NUM</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDET_SAR_CLK_EN</name>
              <description>xxxx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BS_CONF</name>
          <description>BS configuration register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BS_CLK_EN</name>
              <description>Set 1 to enable bs clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_RST_EN</name>
              <description>Set 0 to reset bs module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BS_FUNC_CONF</name>
          <description>BS_FUNC_CLK configuration register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BS_TX_RST_EN</name>
              <description>Set 0 to reset bs tx module</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_RX_RST_EN</name>
              <description>Set 0 to reset bs rx module</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BS_PD_CTRL</name>
          <description>BS power control register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>BS_MEM_FORCE_PU</name>
              <description>Set this bit to force power up bs memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_MEM_FORCE_PD</name>
              <description>Set this bit to force power down bs memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP_WDT_CONF</name>
          <description>TIMERGROUP_WDT configuration register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_WDT_RST_EN</name>
              <description>Set 0 to reset timer_group0 wdt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_RST_EN</name>
              <description>Set 0 to reset timer_group1 wdt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP_XTAL_CONF</name>
          <description>TIMERGROUP1 configuration register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>TG0_XTAL_RST_EN</name>
              <description>Set 0 to reset timer_group0 xtal clock domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_XTAL_RST_EN</name>
              <description>Set 0 to reset timer_group1 xtal clock domain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_XTAL_CLK_EN</name>
              <description>Set 1 to enable tg0 xtal clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_CONF</name>
          <description>Key Manager configuration register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>KM_CLK_EN</name>
              <description>Set 1 to enable km clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_RST_EN</name>
              <description>Set 0 to reset km module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_READY</name>
              <description>Query this field after reset km module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_PD_CTRL</name>
          <description>Key Manager power control register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>KM_MEM_FORCE_PU</name>
              <description>Set this bit to force power up KM memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_MEM_FORCE_PD</name>
              <description>Set this bit to force power down KM memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCM_MEM_MONITOR_CONF</name>
          <description>TCM_MEM_MONITOR configuration register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>TCM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable tcm_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_RST_EN</name>
              <description>Set 0 to reset tcm_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_READY</name>
              <description>Query this field after reset tcm_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MEM_MONITOR_CONF</name>
          <description>PSRAM_MEM_MONITOR configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>PSRAM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable psram_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_RST_EN</name>
              <description>Set 0 to reset psram_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_READY</name>
              <description>Query this field after reset psram_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
