esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
