esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHA</name>
      <description>SHA (Secure Hash Algorithm) Accelerator</description>
      <groupName>SHA</groupName>
      <baseAddress>0x60089000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x26c</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHA</name>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>MODE</name>
          <description>Configures SHA algorithm</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures the SHA algorithm. \\
0: SHA-1\\
1: SHA-224\\
2: SHA-256\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T_STRING</name>
          <description>SHA 512/t configuration register 0.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_STRING</name>
              <description>Sha t_string (used if and only if mode == SHA_512/t).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T_LENGTH</name>
          <description>SHA 512/t configuration register 1.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LENGTH</name>
              <description>Sha t_length (used if and only if mode == SHA_512/t).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_BLOCK_NUM</name>
          <description>Block number register (only effective for DMA-SHA)</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_BLOCK_NUM</name>
              <description>Configures the DMA-SHA block number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>Starts the SHA accelerator for Typical SHA operation</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to start Typical SHA calculation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTINUE</name>
          <description>Continues SHA operation (only effective in Typical SHA mode)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONTINUE</name>
              <description>Write 1 to continue Typical SHA calculation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUSY</name>
          <description>Represents if SHA Accelerator is busy or not</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Represents the states of SHA accelerator. \\
0: idle\\
1: busy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_START</name>
          <description>Starts the SHA accelerator for DMA-SHA operation</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_START</name>
              <description>Write 1 to start DMA-SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CONTINUE</name>
          <description>Continues SHA operation (only effective in DMA-SHA mode)</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_CONTINUE</name>
              <description>Write 1 to continue DMA-SHA calculation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEAR_IRQ</name>
          <description>DMA-SHA interrupt clear register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLEAR_INTERRUPT</name>
              <description>Write 1 to clear DMA-SHA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENA</name>
          <description>DMA-SHA interrupt enable register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTERRUPT_ENA</name>
              <description>Write 1 to enable DMA-SHA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x20201229</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>H_MEM[%s]</name>
          <description>Sha H memory which contains intermediate hash or finial hash.</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>Sha M memory which contains message.</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>_3_MODE</name>
          <description>Initial configuration register 0.</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_MODE</name>
              <description>Sha3 mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CLEAN_M</name>
          <description>Initial configuration register 1.</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_CLEAN_M</name>
              <description>Clean Message.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_BLOCK_NUM</name>
          <description>DMA configuration register 0.</description>
          <addressOffset>0x80c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_DMA_BLOCK_NUM</name>
              <description>DMA-SHA3 block number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_START</name>
          <description>Typical SHA3 configuration register 0.</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_START</name>
              <description>Start typical sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CONTINUE</name>
          <description>Typical SHA3 configuration register 1.</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_CONTINUE</name>
              <description>Continue typical sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_BUSY</name>
          <description>Busy register.</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_BUSY</name>
              <description>Sha3 busy state. 1'b0: idle. 1'b1: busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_START</name>
          <description>DMA configuration register 1.</description>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_DMA_START</name>
              <description>Start dma-sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_DMA_CONTINUE</name>
          <description>DMA configuration register 2.</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_DMA_CONTINUE</name>
              <description>Continue dma-sha3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_CLEAR_INT</name>
          <description>Interrupt clear register.</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_CLEAR_INT</name>
              <description>Clear sha3 interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_INT_ENA</name>
          <description>Interrupt enable register.</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>_3_INT_ENA</name>
              <description>Sha3 interrupt enable register. 1'b0: disable(default). 1'b1:enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_SHAKE_LENGTH</name>
          <description>DMA configuration register 3.</description>
          <addressOffset>0x82c</addressOffset>
          <size>32</size>
          <resetValue>0x32</resetValue>
          <fields>
            <field>
              <name>_3_SHAKE_LENGTH</name>
              <description>SHAKE output hash word length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_M_OUT_MEM[%s]</name>
          <description>Sha3 hash reg which contains intermediate hash or finial hash.</description>
          <addressOffset>0x900</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>200</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>_3_M_MEM[%s]</name>
          <description>Sha3 message reg which contains message.</description>
          <addressOffset>0xa00</addressOffset>
          <size>8</size>
        </register>
