esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>CH_ENA_AD1_CLR</name>
          <description>Channel enable clear register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_DISABLE32</name>
              <description>Configures whether or not to clear ch32 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE33</name>
              <description>Configures whether or not to clear ch33 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE34</name>
              <description>Configures whether or not to clear ch34 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE35</name>
              <description>Configures whether or not to clear ch35 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE36</name>
              <description>Configures whether or not to clear ch36 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE37</name>
              <description>Configures whether or not to clear ch37 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE38</name>
              <description>Configures whether or not to clear ch38 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE39</name>
              <description>Configures whether or not to clear ch39 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE40</name>
              <description>Configures whether or not to clear ch40 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE41</name>
              <description>Configures whether or not to clear ch41 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE42</name>
              <description>Configures whether or not to clear ch42 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE43</name>
              <description>Configures whether or not to clear ch43 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE44</name>
              <description>Configures whether or not to clear ch44 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE45</name>
              <description>Configures whether or not to clear ch45 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE46</name>
              <description>Configures whether or not to clear ch46 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE47</name>
              <description>Configures whether or not to clear ch47 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE48</name>
              <description>Configures whether or not to clear ch48 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_DISABLE49</name>
              <description>Configures whether or not to clear ch49 enable.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>50</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%s_EVT_ID</name>
          <description>Channel%s event id register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_EVT_ID</name>
              <description>Configures ch%s_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>50</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%s_TASK_ID</name>
          <description>Channel%s task id register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_TASK_ID</name>
              <description>Configures ch%s_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST0</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EVT_CH0_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_POS0_ST</name>
              <description>Represents GPIO_evt_zero_det_pos0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_NEG0_ST</name>
              <description>Represents GPIO_evt_zero_det_neg0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH0_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH1_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH2_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH3_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH4_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch4 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH5_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch5 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
