esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI2</name>
      <description>SPI (Serial Peripheral Interface) Controller 2</description>
      <groupName>SPI2</groupName>
      <baseAddress>0x60081000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x98</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPSPI2</name>
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>SPI_CMD</name>
          <description>Command control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_CONF_BITLEN</name>
              <description>Configures the SPI_CLK cycles of SPI CONF state.
Measurement unit: SPI_CLK clock cycle.\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_UPDATE</name>
              <description>Configures whether or not to synchronize SPI registers from APB clock domain into SPI module clock domain. \\
0: Not synchronize \\
1: Synchronize \\
This bit is only used in SPI master transfer.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_USR</name>
              <description>Configures whether or not to enable user-defined command. \\
0: Not enable \\
1: Enable \\
An SPI operation will be triggered when the bit is set. This bit will be cleared once the operation is done. Can not be changed by CONF_buf.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_ADDR</name>
          <description>Address value register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_USR_ADDR_VALUE</name>
              <description>Configures the address to slave.
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CTRL</name>
          <description>SPI control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x3c0000</resetValue>
          <fields>
            <field>
              <name>SPI_DUMMY_OUT</name>
              <description>Configures whether or not to output the FSPI bus signals in DUMMY state. \\
0: Not output \\
1: Output \\
Can be configured in CONF state.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FADDR_DUAL</name>
              <description>Configures whether or not to enable 2-bit mode during address (ADDR) state.\\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FADDR_QUAD</name>
              <description>Configures whether or not to enable 4-bit mode during address (ADDR) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FADDR_OCT</name>
              <description>Configures whether or not to enable 8-bit mode during address (ADDR) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_FCMD_DUAL</name>
              <description>Configures whether or not to enable 2-bit mode during command (CMD) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FCMD_QUAD</name>
              <description>Configures whether or not to enable 4-bit mode during command (CMD) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FCMD_OCT</name>
              <description>Configures whether or not to enable 8-bit mode during command (CMD) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_FREAD_DUAL</name>
              <description>Configures whether or not to enable the 2-bit mode of read-data (DIN) state in read operations. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FREAD_QUAD</name>
              <description>Configures whether or not to enable the 4-bit mode of read-data (DIN) state in read operations. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FREAD_OCT</name>
              <description>Configures whether or not to enable the 8-bit mode of read-data (DIN) state in read operations. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_Q_POL</name>
              <description>Configures MISO line polarity. \\
0: Low \\
1: High \\
Can be configured in CONF state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_D_POL</name>
              <description>Configures MOSI line polarity. \\
0: Low \\
1: High \\
Can be configured in CONF state.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_HOLD_POL</name>
              <description>Configures SPI_HOLD output value when SPI is in idle. \\
0: Output low \\
1: Output high \\
Can be configured in CONF state.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_WP_POL</name>
              <description>Configures the output value of write-protect signal when SPI is in idle. \\
0: Output low \\
1: Output high \\
Can be configured in CONF state.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_RD_BIT_ORDER</name>
              <description>Configures the bit order in read-data (MISO) state. \\
0: MSB first \\
1: LSB first \\
Can be configured in CONF state.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_WR_BIT_ORDER</name>
              <description>Configures the bit order in command (CMD), address (ADDR), and write-data (MOSI) states. \\
0: MSB first \\
1: LSB first \\
Can be configured in CONF state.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CLOCK</name>
          <description>SPI clock control register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x80003043</resetValue>
          <fields>
            <field>
              <name>SPI_CLKCNT_L</name>
              <description>In master transfer, this field must be equal to SPI_CLKCNT_N. In slave mode, it must be 0. Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLKCNT_H</name>
              <description>Configures the duty cycle of SPI_CLK (high level) in master transfer.
It's recommended to configure this value to floor((SPI_CLKCNT_N + 1)/2 - 1). floor() here is to round a number down, e.g., floor(2.2) = 2. In slave mode, it must be 0. \\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLKCNT_N</name>
              <description>Configures the divider of SPI_CLK in master transfer.
SPI_CLK frequency is 12_{\textrm{apb_clk}}$/(SPI_CLKDIV_PRE + 1)/(SPI_CLKCNT_N + 1). \\
Can be configured in CONF state.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLKDIV_PRE</name>
              <description>Configures the pre-divider of SPI_CLK in master transfer.
Can be configured in CONF state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLK_EQU_SYSCLK</name>
              <description>Configures whether or not the SPI_CLK is equal to APB_CLK in master transfer.\\
0: SPI_CLK is divided from APB_CLK.\\
1: SPI_CLK is eqaul to APB_CLK.\\
Can be configured in CONF state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER</name>
          <description>SPI USER control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x800000c0</resetValue>
          <fields>
            <field>
              <name>SPI_DOUTDIN</name>
              <description>Configures whether or not to enable full-duplex communication. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_QPI_MODE</name>
              <description>Configures whether or not to enable QPI mode. \\
0: Disable \\
1: Enable \\
This configuration is applicable when the SPI controller works as master or slave. Can be configured in CONF state.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_OPI_MODE</name>
              <description>Just for master mode. 1: spi controller is in OPI mode (all in 8-b-m). 0: others. Can be configured in CONF state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_TSCK_I_EDGE</name>
              <description>Configures whether or not to change the polarity of TSCK in slave transfer. \\
0: TSCK = SPI_CK_I \\
1: TSCK = !SPI_CK_I \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS_HOLD</name>
              <description>Configures whether or not to keep SPI CS low when SPI is in DONE state. \\
0: Not keep low \\
1: Keep low \\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS_SETUP</name>
              <description>Configures whether or not to enable SPI CS when SPI is in prepare (PREP) state. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_RSCK_I_EDGE</name>
              <description>Configures whether or not to change the polarity of RSCK in slave transfer. \\
0: RSCK = !SPI_CK_I \\
1: RSCK = SPI_CK_I \\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CK_OUT_EDGE</name>
              <description>Configures SPI clock mode together with SPI_CK_IDLE_EDGE.
Can be configured in CONF state. For more information, see Section &lt;a href=&quot;GP-SPI2 master clock control&quot;&gt;link&lt;/a&gt;.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FWRITE_DUAL</name>
              <description>Configures whether or not to enable the 2-bit mode of read-data phase in write operations.\\
0: Not enable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FWRITE_QUAD</name>
              <description>Configures whether or not to enable the 4-bit mode of read-data phase in write operations. \\
0: Not enable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FWRITE_OCT</name>
              <description>In the write operations read-data phase apply 8 signals. Can be configured in CONF state.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_USR_CONF_NXT</name>
              <description>Configures whether or not to enable the CONF state for the next transaction (segment) in a configurable segmented transfer. \\
0: this transfer will end after the current transaction (segment) is finished. Or this is not a configurable segmented transfer. \\
1: this configurable segmented transfer will continue its next transaction (segment). \\
Can be configured in CONF state.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SIO</name>
              <description>Configures whether or not to enable 3-line half-duplex communication, where MOSI and MISO signals share the same pin.\\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_MISO_HIGHPART</name>
              <description>Configures whether or not to enable high part mode, i.e., only access to high part of the buffers: SPI_W8_REG ~ SPI_W15_REG in read-data phase. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_MOSI_HIGHPART</name>
              <description>Configures whether or not to enable high part mode, i.e., only access to high part of the buffers: SPI_W8_REG ~ SPI_W15_REG in write-data phase. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_DUMMY_IDLE</name>
              <description>Configures whether or not to disable SPI clock in DUMMY state. \\
0: Not disable \\
1: Disable \\
Can be configured in CONF state.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_MOSI</name>
              <description>Configures whether or not to enable the write-data (DOUT) state of an operation. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_MISO</name>
              <description>Configures whether or not to enable the read-data (DIN) state of an operation. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_DUMMY</name>
              <description>Configures whether or not to enable the DUMMY state of an operation. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_ADDR</name>
              <description>Configures whether or not to enable the address (ADDR) state of an operation. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_COMMAND</name>
              <description>Configures whether or not to enable the command (CMD) state of an operation. \\
0: Disable \\
1: Enable \\
Can be configured in CONF state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER1</name>
          <description>SPI USER control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0xb8410007</resetValue>
          <fields>
            <field>
              <name>SPI_USR_DUMMY_CYCLELEN</name>
              <description>Configures the length of DUMMY state.
Measurement unit: SPI_CLK clock cycles.\\
This value is (the expected cycle number - 1). Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_WFULL_ERR_END_EN</name>
              <description>Configures whether or not to end the SPI transfer when SPI RX AFIFO wfull error occurs in master full-/half-duplex transfers. \\
0: Not end \\
1: End \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS_SETUP_TIME</name>
              <description>Configures the length of prepare (PREP) state.
Measurement unit: SPI_CLK clock cycles.\\
This value is equal to the expected cycles - 1. This field is used together with SPI_CS_SETUP. Can be configured in CONF state.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS_HOLD_TIME</name>
              <description>Configures the delay cycles of CS pin.
Measurement unit: SPI_CLK clock cycles. \\
This field is used together with SPI_CS_HOLD. Can be configured in CONF state.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_ADDR_BITLEN</name>
              <description>Configures the bit length in address state.
This value is (expected bit number - 1). Can be configured in CONF state.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER2</name>
          <description>SPI USER control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x78000000</resetValue>
          <fields>
            <field>
              <name>SPI_USR_COMMAND_VALUE</name>
              <description>Configures the command value.
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_REMPTY_ERR_END_EN</name>
              <description>Configures whether or not to end the SPI transfer when SPI TX AFIFO read empty error occurs in master full-/half-duplex transfers. \\
0: Not end \\
1: End \\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_COMMAND_BITLEN</name>
              <description>Configures the bit length of command state.
This value is (expected bit number - 1). Can be configured in CONF state.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
