esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        - if new data is filled in DMA TX FIFO, new data will be transmitted.
        - if no new data is filled in DMA TX FIFO, no new data will be transmitted.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_RX_EOF_EN</name>
              <description>1: In a DAM-controlled transfer, if the bit number of transferred data is equal to (SPI_MS_DATA_BITLEN + 1), then GDMA_IN_SUC_EOF_CH\it{n}_INT_RAW will be set by hardware. 0: GDMA_IN_SUC_EOF_CH\it{n}_INT_RAW is set by SPI_TRANS_DONE_INT event in a single transfer, or by an SPI_DMA_SEG_TRANS_DONE_INT event in a segmented transfer.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_RX_ENA</name>
              <description>Configures whether or not to enable DMA-controlled receive data transfer.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_TX_ENA</name>
              <description>Configures whether or not to enable DMA-controlled send data transfer.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_RX_AFIFO_RST</name>
              <description>Configures whether or not to reset spi_rx_afifo as shown in Figure &lt;a href=&quot;fig:spi-master-data-flow-control&quot;&gt;link&lt;/a&gt; and in Figure  &lt;a href=&quot;fig:spi-slave-data-flow-control&quot;&gt;link&lt;/a&gt;.\\
0: Not reset\\
1: Reset\\
spi_rx_afifo is used to receive data in SPI master and slave transfer.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_BUF_AFIFO_RST</name>
              <description>Configures whether or not to reset buf_tx_afifo as shown in Figure &lt;a href=&quot;fig:spi-master-data-flow-control&quot;&gt;link&lt;/a&gt; and in Figure  &lt;a href=&quot;fig:spi-slave-data-flow-control&quot;&gt;link&lt;/a&gt;.\\
0: Not reset\\
1: Reset\\
buf_tx_afifo is used to send data out in CPU-controlled master and slave transfer.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_DMA_AFIFO_RST</name>
              <description>Configures whether or not to reset dma_tx_afifo as shown in Figure &lt;a href=&quot;fig:spi-master-data-flow-control&quot;&gt;link&lt;/a&gt; and in Figure  &lt;a href=&quot;fig:spi-slave-data-flow-control&quot;&gt;link&lt;/a&gt;.\\
0: Not reset\\
1: Reset\\
dma_tx_afifo is used to send data out in DMA-controlled slave transfer.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DMA_INT_ENA</name>
          <description>SPI interrupt enable register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DMA_INFIFO_FULL_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_DMA_INFIFO_FULL_ERR_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_OUTFIFO_EMPTY_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_DMA_OUTFIFO_EMPTY_ERR_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_EX_QPI_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_EX_QPI_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_EN_QPI_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_EN_QPI_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD7_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_CMD7_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD8_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_CMD8_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD9_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_CMD9_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMDA_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_CMDA_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RD_DMA_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_RD_DMA_DONE_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WR_DMA_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_WR_DMA_DONE_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RD_BUF_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_RD_BUF_DONE_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WR_BUF_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_WR_BUF_DONE_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_TRANS_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_TRANS_DONE_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_SEG_TRANS_DONE_INT_ENA</name>
              <description>Write 1 to enable SPI_DMA_SEG_TRANS_DONE_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SEG_MAGIC_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_SEG_MAGIC_ERR_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_BUF_ADDR_ERR_INT_ENA</name>
              <description>The enable bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_SLV_CMD_ERR_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_RX_AFIFO_WFULL_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_TX_AFIFO_REMPTY_ERR_INT_ENA</name>
              <description>Write 1 to enable SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_APP2_INT_ENA</name>
              <description>Write 1 to enable SPI_APP2_INT interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_APP1_INT_ENA</name>
              <description>Write 1 to enable SPI_APP1_INT interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DMA_INT_CLR</name>
          <description>SPI interrupt clear register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DMA_INFIFO_FULL_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_DMA_INFIFO_FULL_ERR_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_DMA_OUTFIFO_EMPTY_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_DMA_OUTFIFO_EMPTY_ERR_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_EX_QPI_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_EX_QPI_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_EN_QPI_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_EN_QPI_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_CMD7_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_CMD7_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_CMD8_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_CMD8_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_CMD9_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_CMD9_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_CMDA_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_CMDA_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_RD_DMA_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_RD_DMA_DONE_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_WR_DMA_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_WR_DMA_DONE_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_RD_BUF_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_RD_BUF_DONE_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_WR_BUF_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_WR_BUF_DONE_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_TRANS_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_TRANS_DONE_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_DMA_SEG_TRANS_DONE_INT_CLR</name>
              <description>Write 1 to clear SPI_DMA_SEG_TRANS_DONE_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SEG_MAGIC_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_SEG_MAGIC_ERR_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_BUF_ADDR_ERR_INT_CLR</name>
              <description>The clear bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_SLV_CMD_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_SLV_CMD_ERR_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MST_RX_AFIFO_WFULL_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_MST_TX_AFIFO_REMPTY_ERR_INT_CLR</name>
              <description>Write 1 to clear SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_APP2_INT_CLR</name>
              <description>Write 1 to clear SPI_APP2_INT interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SPI_APP1_INT_CLR</name>
              <description>Write 1 to clear SPI_APP1_INT interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DMA_INT_RAW</name>
          <description>SPI interrupt raw register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DMA_INFIFO_FULL_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_DMA_INFIFO_FULL_ERR_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_DMA_OUTFIFO_EMPTY_ERR_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_EX_QPI_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_EX_QPI_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_EN_QPI_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_EN_QPI_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD7_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_CMD7_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD8_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_CMD8_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD9_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_CMD9_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMDA_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_CMDA_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RD_DMA_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_RD_DMA_DONE_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WR_DMA_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_WR_DMA_DONE_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RD_BUF_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_RD_BUF_DONE_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_WR_BUF_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_WR_BUF_DONE_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_TRANS_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_TRANS_DONE_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DMA_SEG_TRANS_DONE_INT_RAW</name>
              <description>The raw interrupt status of SPI_DMA_SEG_TRANS_DONE_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SEG_MAGIC_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_SEG_MAGIC_ERR_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_BUF_ADDR_ERR_INT_RAW</name>
              <description>The raw bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt. 1: The accessing data address of the current SPI slave mode CPU controlled FD, Wr_BUF or Rd_BUF transmission is bigger than 63. 0: Others.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_CMD_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_SLV_CMD_ERR_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW</name>
              <description>The raw interrupt status of SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_APP2_INT_RAW</name>
              <description>The raw interrupt status of SPI_APP2_INT interrupt. The value is only controlled by the application.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_APP1_INT_RAW</name>
              <description>The raw interrupt status of SPI_APP1_INT interrupt. The value is only controlled by the application.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
