esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>WDTCONFIG0</name>
          <description>Watchdog timer configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x4c000</resetValue>
          <fields>
            <field>
              <name>WDT_APPCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PROCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>Configures whether to enable flash boot protection.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>Configures the system reset signal length. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>Configures the CPU reset signal length. Valid only when write protection is disabled.\\
Measurement unit: mwdt_clk \\
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_USE_XTAL</name>
              <description>choose WDT clock:0-apb_clk, 1-xtal_clk.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CONF_UPDATE_EN</name>
              <description>Configures to update the WDT configuration registers.\\
0: No effect \\
1: Update \\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>Configures the timeout action of stage 3. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>Configures the  timeout action of stage 2. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>Configures the  timeout action of stage 1. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>Configures the timeout action of stage 0. Valid only when write protection is disabled. \\
0: No effect \\
1: Interrupt \\
2: Reset CPU \\
3: Reset system \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>Configures whether or not to enable the MWDT. Valid only when write protection is disabled. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG1</name>
          <description>Watchdog timer prescaler register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x10000</resetValue>
          <fields>
            <field>
              <name>WDT_DIVCNT_RST</name>
              <description>Configures whether to reset WDT 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_CLK_PRESCALE</name>
              <description>Configures MWDT clock prescaler value. Valid only when write protection is disabled. \\
MWDT clock period = MWDT's clock source period * TIMG_WDT_CLK_PRESCALE. \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG2</name>
          <description>Watchdog timer stage 0 timeout value</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x18cba80</resetValue>
          <fields>
            <field>
              <name>WDT_STG0_HOLD</name>
              <description>Configures the stage 0 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG3</name>
          <description>Watchdog timer stage 1 timeout value</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x7ffffff</resetValue>
          <fields>
            <field>
              <name>WDT_STG1_HOLD</name>
              <description>Configures the stage 1 timeout value. Valid only when write protection is disabled.\\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG4</name>
          <description>Watchdog timer stage 2 timeout value</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0xfffff</resetValue>
          <fields>
            <field>
              <name>WDT_STG2_HOLD</name>
              <description>Configures the stage 2 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG5</name>
          <description>Watchdog timer stage 3 timeout value</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0xfffff</resetValue>
          <fields>
            <field>
              <name>WDT_STG3_HOLD</name>
              <description>Configures the stage 3 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTFEED</name>
          <description>Write to feed the watchdog timer</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_FEED</name>
              <description>Write any value to feed the MWDT. Valid only when write protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTWPROTECT</name>
          <description>Watchdog write protect register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x50d83aa1</resetValue>
          <fields>
            <field>
              <name>WDT_WKEY</name>
              <description>Configures a different value than its reset value to enable write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG</name>
          <description>RTC frequency calculation configuration register 0</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x11000</resetValue>
          <fields>
            <field>
              <name>RTC_CALI_START_CYCLING</name>
              <description>Configures the frequency calculation mode.  \\
0: one-shot frequency calculation \\
1: periodic frequency calculation \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_CLK_SEL</name>
              <description>Configures to select the clock to be calibrated\\
0: RTC_SLOW_CLK\\
1: RC_FAST_DIV_CLK\\
2: XTAL32K_CLK\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_RDY</name>
              <description>Represents whether one-shot frequency calculation is done.\\
0: Not done \\
1: Done \\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_MAX</name>
              <description>Configures the time to calculate RTC slow clock's frequency. \\
Measurement unit: XTAL_CLK \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_START</name>
              <description>Configures whether to enable one-shot frequency calculation. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG1</name>
          <description>RTC frequency calculation configuration register 1</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTC_CALI_CYCLING_DATA_VLD</name>
              <description>Represents whether periodic frequency calculation is done. \\
0: Not done \\
1: Done \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_VALUE</name>
              <description>Represents the value countered by XTAL_CLK when one-shot or periodic frequency calculation is done. It is used to calculate RTC slow clock's frequency.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_TIMERS</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T0_INT_ENA</name>
              <description>Write 1 to enable the TIMG_T0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T1_INT_ENA</name>
              <description>Write 1 to enable the TIMG_T1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_INT_ENA</name>
              <description>Write 1 to enable the TIMG_WDT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW_TIMERS</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T0_INT_RAW</name>
              <description>The raw interrupt status bit of the TIMG_T0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>T1_INT_RAW</name>
              <description>The raw interrupt status bit of the TIMG_T1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT_RAW</name>
              <description>The raw interrupt status bit of the TIMG_WDT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST_TIMERS</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T0_INT_ST</name>
              <description>The masked interrupt status bit of the TIMG_T0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>T1_INT_ST</name>
              <description>The masked interrupt status bit of the TIMG_T1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT_ST</name>
              <description>The masked interrupt status bit of the TIMG_WDT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR_TIMERS</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T0_INT_CLR</name>
              <description>Write 1 to clear the TIMG_T0_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>T1_INT_CLR</name>
              <description>Write 1 to clear the TIMG_T1_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_INT_CLR</name>
              <description>Write 1 to clear the TIMG_WDT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCALICFG2</name>
          <description>RTC frequency calculation configuration register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0xffffff98</resetValue>
          <fields>
            <field>
              <name>RTC_CALI_TIMEOUT</name>
              <description>Represents whether RTC frequency calculation is timeout. \\
0: No timeout \\
1: Timeout \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_CALI_TIMEOUT_RST_CNT</name>
              <description>Configures the cycles that reset frequency calculation timeout. \\
Measurement unit: XTAL_CLK \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC_CALI_TIMEOUT_THRES</name>
              <description>Configures the threshold value for the RTC frequency calculation timer. If the timer's value exceeds this threshold, a timeout is triggered.\\
Measurement unit: XTAL_CLK  \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTIMERS_DATE</name>
          <description>Timer version control register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x2209142</resetValue>
          <fields>
            <field>
              <name>NTIMGS_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGCLK</name>
          <description>Timer group clock gate register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x70000000</resetValue>
          <fields>
            <field>
              <name>ETM_EN</name>
              <description>Configures whether to enable timer's ETM task and event. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CLK_IS_ACTIVE</name>
              <description>Configures whether to enable WDT's clock. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_CLK_IS_ACTIVE</name>
              <description>Configures whether to enable Timer 30's clock.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to enable gate clock signal for registers. \\
0: Force clock on for registers \\
1: Support clock only when registers are read or written to by software. \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
