esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TWAI0">
      <name>TWAI1</name>
      <baseAddress>0x6000d000</baseAddress>
      <description>Two-Wire Automotive Interface</description>
      <interrupt>
        <name>TWAI1</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TWAI1_TIMER</name>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>UART0</name>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller 0</description>
      <groupName>UART</groupName>
      <baseAddress>0x60000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x98</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>47</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>FIFO data register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFIFO_RD_BYTE</name>
              <description>Represents the data UART 0 read from FIFO.\\
Measurement unit: byte.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>RXFIFO_FULL_INT_RAW</name>
              <description>The raw interrupt status of UART_RXFIFO_FULL_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_EMPTY_INT_RAW</name>
              <description>The raw interrupt status of UART_TXFIFO_EMPTY_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITY_ERR_INT_RAW</name>
              <description>The raw interrupt status of UART_PARITY_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRM_ERR_INT_RAW</name>
              <description>The raw interrupt status of UART_FRM_ERR_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_OVF_INT_RAW</name>
              <description>The raw interrupt status of UART_RXFIFO_OVF_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR_CHG_INT_RAW</name>
              <description>The raw interrupt status of UART_DSR_CHG_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTS_CHG_INT_RAW</name>
              <description>The raw interrupt status of UART_CTS_CHG_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK_DET_INT_RAW</name>
              <description>The raw interrupt status of UART_BRK_DET_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TOUT_INT_RAW</name>
              <description>The raw interrupt status of UART_RXFIFO_TOUT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_XON_INT_RAW</name>
              <description>The raw interrupt status of UART_SW_XON_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_XOFF_INT_RAW</name>
              <description>UART_SW_XOFF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_DET_INT_RAW</name>
              <description>The raw interrupt status of UART_GLITCH_DET_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BRK_DONE_INT_RAW</name>
              <description>The raw interrupt status of UART_TX_BRK_DONE_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BRK_IDLE_DONE_INT_RAW</name>
              <description>The raw interrupt status of UART_TX_BRK_IDLE_DONE_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DONE_INT_RAW</name>
              <description>The raw interrupt status of UART_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_PARITY_ERR_INT_RAW</name>
              <description>The raw interrupt status of UART_RS485_PARITY_ERR_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_FRM_ERR_INT_RAW</name>
              <description>The raw interrupt status of UART_RS485_FRM_ERR_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_CLASH_INT_RAW</name>
              <description>The raw interrupt status of UART_RS485_CLASH_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AT_CMD_CHAR_DET_INT_RAW</name>
              <description>The raw interrupt status of UART_AT_CMD_CHAR_DET_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_INT_RAW</name>
              <description>The raw interrupt status of UART_WAKEUP_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFIFO_FULL_INT_ST</name>
              <description>The masked interrupt status of UART_RXFIFO_FULL_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFIFO_EMPTY_INT_ST</name>
              <description>The masked interrupt status of UART_TXFIFO_EMPTY_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PARITY_ERR_INT_ST</name>
              <description>The masked interrupt status of UART_PARITY_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRM_ERR_INT_ST</name>
              <description>The masked interrupt status of UART_FRM_ERR_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFO_OVF_INT_ST</name>
              <description>The masked interrupt status of UART_RXFIFO_OVF_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DSR_CHG_INT_ST</name>
              <description>The masked interrupt status of UART_DSR_CHG_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS_CHG_INT_ST</name>
              <description>The masked interrupt status of UART_CTS_CHG_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BRK_DET_INT_ST</name>
              <description>The masked interrupt status of UART_BRK_DET_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFIFO_TOUT_INT_ST</name>
              <description>The masked interrupt status of UART_RXFIFO_TOUT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_XON_INT_ST</name>
              <description>The masked interrupt status of UART_SW_XON_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_XOFF_INT_ST</name>
              <description>The masked interrupt status of UART_SW_XOFF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GLITCH_DET_INT_ST</name>
              <description>The masked interrupt status of UART_GLITCH_DET_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_BRK_DONE_INT_ST</name>
              <description>The masked interrupt status of UART_TX_BRK_DONE_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_BRK_IDLE_DONE_INT_ST</name>
              <description>The masked interrupt status of UART_TX_BRK_IDLE_DONE_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_DONE_INT_ST</name>
              <description>The masked interrupt status of UART_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RS485_PARITY_ERR_INT_ST</name>
              <description>The masked interrupt status of UART_RS485_PARITY_ERR_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RS485_FRM_ERR_INT_ST</name>
              <description>The masked interrupt status of UART_RS485_FRM_ERR_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RS485_CLASH_INT_ST</name>
              <description>The masked interrupt status of UART_RS485_CLASH_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AT_CMD_CHAR_DET_INT_ST</name>
              <description>The masked interrupt status of UART_AT_CMD_CHAR_DET_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKEUP_INT_ST</name>
              <description>The masked interrupt status of UART_WAKEUP_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXFIFO_FULL_INT_ENA</name>
              <description>Write 1 to enable UART_RXFIFO_FULL_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_EMPTY_INT_ENA</name>
              <description>Write 1 to enable UART_TXFIFO_EMPTY_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARITY_ERR_INT_ENA</name>
              <description>Write 1 to enable UART_PARITY_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRM_ERR_INT_ENA</name>
              <description>Write 1 to enable UART_FRM_ERR_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_OVF_INT_ENA</name>
              <description>Write 1 to enable UART_RXFIFO_OVF_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR_CHG_INT_ENA</name>
              <description>Write 1 to enable UART_DSR_CHG_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTS_CHG_INT_ENA</name>
              <description>Write 1 to enable UART_CTS_CHG_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK_DET_INT_ENA</name>
              <description>Write 1 to enable UART_BRK_DET_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TOUT_INT_ENA</name>
              <description>Write 1 to enable UART_RXFIFO_TOUT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_XON_INT_ENA</name>
              <description>Write 1 to enable UART_SW_XON_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_XOFF_INT_ENA</name>
              <description>Write 1 to enable UART_SW_XOFF_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLITCH_DET_INT_ENA</name>
              <description>Write 1 to enable UART_GLITCH_DET_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BRK_DONE_INT_ENA</name>
              <description>Write 1 to enable UART_TX_BRK_DONE_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BRK_IDLE_DONE_INT_ENA</name>
              <description>Write 1 to enable UART_TX_BRK_IDLE_DONE_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DONE_INT_ENA</name>
              <description>Write 1 to enable UART_TX_DONE_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_PARITY_ERR_INT_ENA</name>
              <description>Write 1 to enable UART_RS485_PARITY_ERR_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_FRM_ERR_INT_ENA</name>
              <description>Write 1 to enable UART_RS485_FRM_ERR_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RS485_CLASH_INT_ENA</name>
              <description>Write 1 to enable UART_RS485_CLASH_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AT_CMD_CHAR_DET_INT_ENA</name>
              <description>Write 1 to enable UART_AT_CMD_CHAR_DET_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_INT_ENA</name>
              <description>Write 1 to enable UART_WAKEUP_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
