esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>ESCAPE_CONF</name>
          <description>Escape character configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x33</resetValue>
          <fields>
            <field>
              <name>TX_C0_ESC_EN</name>
              <description>Configures whether or not to decode character 0xC0 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DB_ESC_EN</name>
              <description>Configures whether or not to decode character 0xDB when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_11_ESC_EN</name>
              <description>Configures whether or not to decode flow control character 0x11 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_13_ESC_EN</name>
              <description>Configures whether or not to decode flow control character 0x13 when DMA receives data.\\
0: Not decode\\
1: Decode\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_C0_ESC_EN</name>
              <description>Configures whether or not to replace 0xC0 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DB_ESC_EN</name>
              <description>Configures whether or not to replace 0xDB by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_11_ESC_EN</name>
              <description>Configures whether or not to replace flow control character 0x11 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_13_ESC_EN</name>
              <description>Configures whether or not to replace flow control character 0x13 by special characters when DMA sends data.\\
0: Not replace\\
1: Replace\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUNG_CONF</name>
          <description>Timeout configuration</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x810810</resetValue>
          <fields>
            <field>
              <name>TXFIFO_TIMEOUT</name>
              <description>Configures the timeout value for DMA data reception.\\Measurement unit: ms.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_SHIFT</name>
              <description>Configures the upper limit of the timeout counter for TX FIFO.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFO_TIMEOUT_ENA</name>
              <description>Configures whether or not to enable the data reception timeout for TX FIFO.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT</name>
              <description>Configures the timeout value for DMA to read data from RAM.\\Measurement unit: ms.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_SHIFT</name>
              <description>Configures the upper limit of the timeout counter for RX FIFO.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFIFO_TIMEOUT_ENA</name>
              <description>Configures whether or not to enable the DMA data transmission timeout.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACK_NUM</name>
          <description>UHCI ACK number configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACK_NUM</name>
              <description>Configures the number of acknowledgements used in software flow control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Configures whether or not load acknowledgements.\\
0: Not load\\
1: Load\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_HEAD</name>
          <description>UHCI packet header register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_HEAD</name>
              <description>Represents the header of the current received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUICK_SENT</name>
          <description>UHCI quick send configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SINGLE_SEND_NUM</name>
              <description>Configures the source of data to be transmitted in single_send mode.\\
0: Q0 register\\
1: Q1 register\\
2: Q2 register\\
3: Q3 register\\
4: Q4 register\\
5: Q5 register\\
6: Q6 register\\
7: Invalid. No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLE_SEND_EN</name>
              <description>Write 1 to enable single_send mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALWAYS_SEND_NUM</name>
              <description>Configures the source of data to be transmitted in always_send mode.\\
0: Q0 register\\
1: Q1 register\\
2: Q2 register\\
3: Q3 register\\
4: Q4 register\\
5: Q5 register\\
6: Q6 register\\
7: Invalid. No effect\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALWAYS_SEND_EN</name>
              <description>Configures whether or not to enable always_send mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q0_WORD0</name>
          <description>Q0 WORD0 quick send register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD0</name>
              <description>Data to be transmitted in Q0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q0_WORD1</name>
          <description>Q0 WORD1 quick send register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q0_WORD1</name>
              <description>Data to be transmitted in Q0 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q1_WORD0</name>
          <description>Q1 WORD0 quick send register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD0</name>
              <description>Data to be transmitted in Q1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q1_WORD1</name>
          <description>Q1 WORD1 quick send register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q1_WORD1</name>
              <description>Data to be transmitted in Q1 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q2_WORD0</name>
          <description>Q2 WORD0 quick send register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD0</name>
              <description>Data to be transmitted in Q2 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q2_WORD1</name>
          <description>Q2 WORD1 quick send register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q2_WORD1</name>
              <description>Data to be transmitted in Q2 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q3_WORD0</name>
          <description>Q3 WORD0 quick send register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD0</name>
              <description>Data to be transmitted in Q3 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q3_WORD1</name>
          <description>Q3 WORD1 quick send register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q3_WORD1</name>
              <description>Data to be transmitted in Q3 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q4_WORD0</name>
          <description>Q4 WORD0 quick send register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD0</name>
              <description>Data to be transmitted in Q4 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q4_WORD1</name>
          <description>Q4 WORD1 quick send register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q4_WORD1</name>
              <description>Data to be transmitted in Q4 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q5_WORD0</name>
          <description>Q5 WORD0 quick send register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD0</name>
              <description>Data to be transmitted in Q5 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q5_WORD1</name>
          <description>Q5 WORD1 quick send register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q5_WORD1</name>
              <description>Data to be transmitted in Q5 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q6_WORD0</name>
          <description>Q6 WORD0 quick send register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD0</name>
              <description>Data to be transmitted in Q6 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_Q6_WORD1</name>
          <description>Q6 WORD1 quick register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD1</name>
              <description>Data to be transmitted in Q6 register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF0</name>
          <description>Escape sequence configuration register 0</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0xdcdbc0</resetValue>
          <fields>
            <field>
              <name>SEPER_CHAR</name>
              <description>Configures separators to encode data packets. The default value is 0xC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDC.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF1</name>
          <description>Escape sequence configuration register 1</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0xdddbdb</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ0</name>
              <description>Configures the character that needs to be encoded. The default value is 0xDB used as the first character of SLIP escape sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDD.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF2</name>
          <description>Escape sequence configuration register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0xdedb11</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ1</name>
              <description>Configures a character that need to be encoded. The default value is 0x11 used as a flow control character.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF3</name>
          <description>Escape sequence configuration register 3</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xdfdb13</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ2</name>
              <description>Configures the character that needs to be decoded. The default value is 0x13 used as a flow control character.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR0</name>
              <description>Configures the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR1</name>
              <description>Configures the second character of SLIP escape sequence. The default value is 0xDF.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_THRES</name>
          <description>Configuration register for packet length</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>PKT_THRS</name>
              <description>Configures the maximum value of the packet length.\\Measurement unit: byte.\\Valid only when UHCI_HEAD_EN is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>UHCI version  control register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x2201100</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
