esp-rs/esp-pacs/esp32c5/svd/esp32c5.base.svd
        <register>
          <name>MEM_CONF</name>
          <description>Memory power control</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>USB_MEM_PD</name>
              <description>1: power down usb memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_MEM_CLK_EN</name>
              <description>1: Force clock on for usb memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_RST</name>
          <description>CDC-ACM chip reset control.</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTS</name>
              <description>1: Chip reset is detected from usb serial channel. Software write 1 to clear it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTR</name>
              <description>1: Chip reset is detected from usb jtag channel. Software write 1 to clear it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_UART_CHIP_RST_DIS</name>
              <description>Set this bit to disable chip reset from usb serial channel to reset chip.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_LINE_CODE_W0</name>
          <description>W0 of SET_LINE_CODING command.</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DW_DTE_RATE</name>
              <description>The value of dwDTERate set by host through SET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_LINE_CODE_W1</name>
          <description>W1 of SET_LINE_CODING command.</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BCHAR_FORMAT</name>
              <description>The value of bCharFormat set by host through SET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BPARITY_TYPE</name>
              <description>The value of bParityTpye set by host through SET_LINE_CODING command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDATA_BITS</name>
              <description>The value of bDataBits set by host through SET_LINE_CODING command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GET_LINE_CODE_W0</name>
          <description>W0 of GET_LINE_CODING command.</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GET_DW_DTE_RATE</name>
              <description>The value of dwDTERate set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GET_LINE_CODE_W1</name>
          <description>W1 of GET_LINE_CODING command.</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GET_BDATA_BITS</name>
              <description>The value of bCharFormat set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GET_BPARITY_TYPE</name>
              <description>The value of bParityTpye set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GET_BCHAR_FORMAT</name>
              <description>The value of bDataBits set by software which is requested by GET_LINE_CODING command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_UPDATE</name>
          <description>Configuration registers' value update</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CONFIG_UPDATE</name>
              <description>Write 1 to this register would update the value of configure registers from APB clock domain to 48MHz clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER_AFIFO_CONFIG</name>
          <description>Serial AFIFO configure register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>SERIAL_IN_AFIFO_RESET_WR</name>
              <description>Write 1 to reset CDC_ACM IN async FIFO write clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_IN_AFIFO_RESET_RD</name>
              <description>Write 1 to reset CDC_ACM IN async FIFO read clock domain.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_OUT_AFIFO_RESET_WR</name>
              <description>Write 1 to reset CDC_ACM OUT async FIFO write clock domain.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_OUT_AFIFO_RESET_RD</name>
              <description>Write 1 to reset CDC_ACM OUT async FIFO read clock domain.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_OUT_AFIFO_REMPTY</name>
              <description>CDC_ACM OUTOUT async FIFO empty signal in read clock domain.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIAL_IN_AFIFO_WFULL</name>
              <description>CDC_ACM OUT IN async FIFO empty signal in write clock domain.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_RESET_ST</name>
          <description>USB Bus reset status register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>USB_BUS_RESET_ST</name>
              <description>USB bus reset status. 0: USB-Serial-JTAG is in usb bus reset status. 1: USB bus reset is released.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SERIAL_EP_TIMEOUT0</name>
          <description>USB uart out endpoint timeout configuration.</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SERIAL_TIMEOUT_EN</name>
              <description>USB serial out ep timeout enable. When a timeout event occurs, serial out ep buffer is automatically cleared and reg_serial_timeout_status is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_TIMEOUT_STATUS</name>
              <description>Serial out ep triggers a timeout event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SERIAL_TIMEOUT_STATUS_CLR</name>
              <description>Write 1 to clear reg_serial_timeout_status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SERIAL_EP_TIMEOUT1</name>
          <description>USB uart out endpoint timeout configuration.</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x494100</resetValue>
          <fields>
            <field>
              <name>SERIAL_TIMEOUT_MAX</name>
              <description>USB serial out ep timeout max threshold value, indicates the maximum time that waiting for ESP to take away data in memory. This value is in steps of 20.83ns.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x2311240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
